### car price prediction

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from statsmodels.stats.outliers_influence import variance_inflation_factor
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression 
from sklearn.metrics import mean_squared_error, mean_absolute_error, mean_absolute_percentage_error
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [4]:
import os

In [5]:
os.chdir(r"C:\Users\kalya\Santhosh\Data Science\Notebook\Preprocessing")

In [6]:
data = pd.read_csv("Predict Cab price.csv")

In [7]:
data.head()

   miles  temp  rain  ncabs  price
0      1    30     0     10     20
1      1    38     0      5     40
2      1    25     0      1     50
3      1    20     1     10     50
4      1    15     1      4     80

In [8]:
data['miles'].value_counts()

1    12
2    12
3    12
4    12
5    12
Name: miles, dtype: int64

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   miles   60 non-null     int64
 1   temp    60 non-null     int64
 2   rain    60 non-null     int64
 3   ncabs   60 non-null     int64
 4   price   60 non-null     int64
dtypes: int64(5)
memory usage: 2.5 KB

In [11]:
data.describe().T

       count        mean         std   min   25%    50%     75%    max
miles   60.0    3.000000    1.426148   1.0   2.0    3.0    4.00    5.0
temp    60.0   23.350000    9.166677  10.0  15.0   21.0   30.00   39.0
rain    60.0    0.500000    0.504219   0.0   0.0    0.5    1.00    1.0
ncabs   60.0    5.416667    3.632675   1.0   2.0    4.5   10.00   11.0
price   60.0  157.683333  119.883629  20.0  80.0  123.5  200.25  555.0

In [12]:
scale = StandardScaler()
X = pd.DataFrame(scale.fit_transform(data.drop(columns='price')), columns = data.drop(columns='price').columns)

In [14]:
X.head()

      miles      temp  rain     ncabs
0 -1.414214  0.731576  -1.0  1.272344
1 -1.414214  1.611667  -1.0 -0.115668
2 -1.414214  0.181519  -1.0 -1.226077
3 -1.414214 -0.368538   1.0  1.272344
4 -1.414214 -0.918595   1.0 -0.393270

In [15]:
y = data['price']

In [16]:
y.head()

0    20
1    40
2    50
3    50
4    80
Name: price, dtype: int64

In [17]:
train_X, test_X, train_y, test_y = train_test_split(X,y,test_size = 0.3, random_state=2)

In [18]:
train_X.shape, test_X.shape, train_y.shape, test_y.shape

((42, 4), (18, 4), (42,), (18,))

In [19]:
model = LinearRegression()

In [20]:
model.fit(train_X,train_y)

LinearRegression()

In [21]:
model.coef_

array([ 77.88736938, -32.30545748,  40.46802441, -39.72558695])

In [22]:
model.intercept_

155.0496741740503

In [23]:
train_pred = model.predict(train_X)

In [24]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   miles   60 non-null     float64
 1   temp    60 non-null     float64
 2   rain    60 non-null     float64
 3   ncabs   60 non-null     float64
dtypes: float64(4)
memory usage: 2.0 KB

In [ ]:
## car price = 77.88 * miles   - 32.30 * temp + 40.46 * rain - 39.72 * ncabs

In [25]:
train_pred = model.predict(train_X)

In [26]:
train_pred

array([390.79126221, 226.71478614, 280.64188809, 340.30368392,
        43.95711821, 328.60863791,  40.40314959, 157.42422459,
       143.44458646, 240.81621567,  47.27485048, 177.260348  ,
       122.18566095, 263.47429013, -14.67153747, 214.90529517,
       150.5525237 , 170.49251398, 208.39960307,  32.14762725,
       130.66684156, 109.45747478,  46.72951052,  98.25022896,
         8.48231821, 212.49891165, 267.57359871,  88.3698994 ,
       211.95357169, 285.22899687, -28.45651695, 112.16498087,
        12.03628683, 383.68332496, 225.56720104,  95.47783665,
        70.66494251, 295.89090273, 102.34953754, 153.32491601,
       156.87888464, 175.07962275])

In [28]:
train_mse = mean_squared_error(train_y, train_pred)

In [29]:
train_mae = mean_absolute_error(train_y, train_pred)
train_rmse = np.sqrt(mean_squared_error(train_y, train_pred))

train_mape = mean_absolute_percentage_error(train_y, train_pred)

test_pred = model.predict(test_X)

test_mse = mean_squared_error(test_y, test_pred)

test_mae = mean_absolute_error(test_y, test_pred)

test_rmse = np.sqrt(mean_squared_error(test_y, test_pred))

test_mape = mean_absolute_percentage_error(test_y, test_pred)

In [30]:
train_mse, train_mae, train_rmse, train_mape

(3735.9623695960513, 44.01851456548739, 61.12251933286169, 0.3410900628910891)

In [31]:
test_mse, test_mae, test_rmse, test_mape

(4241.036823711411, 56.65748412326996, 65.12324334453415, 0.9614094758065784)

In [37]:
model.predict([[1,30,0,10]])[0]

-1133.482550324787

In [38]:
y.head()

0    20
1    40
2    50
3    50
4    80
Name: price, dtype: int64

In [33]:
X.head()

      miles      temp  rain     ncabs
0 -1.414214  0.731576  -1.0  1.272344
1 -1.414214  1.611667  -1.0 -0.115668
2 -1.414214  0.181519  -1.0 -1.226077
3 -1.414214 -0.368538   1.0  1.272344
4 -1.414214 -0.918595   1.0 -0.393270

In [35]:
data.head()

   miles  temp  rain  ncabs  price
0      1    30     0     10     20
1      1    38     0      5     40
2      1    25     0      1     50
3      1    20     1     10     50
4      1    15     1      4     80